tutorials/pureDEM/HFDIBDEMFoam/pouringSpheres/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-1.5 -5 -1.5) //0
    (1.5 -5 -1.5) //1
    (1.5 5 -1.5) //2
    (-1.5 5 -1.5) //3
    (-1.5 -5 1.5) //0
    (1.5 -5 1.5) //1
    (1.5  5 1.5) //2
    (-1.5 5 1.5) //3
    //~ (-2 -5 -0.1) //0
    //~ (2 -5 -0.1) //1
    //~ (2 5 -0.1) //2
    //~ (-2 5 -0.1) //3
    //~ (-2 -5 0.1) //4
    //~ (2 -5 0.1) //5
    //~ (2 5 0.1) //6
    //~ (-2 5 0.1) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) Randomizer (30 100 30) simpleGrading (1 1 1)
);
// Note: the initial case settings are the same as for icoFoam/cavity
//       that will crash
edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );

    //     type cyclic;
    //     neighbourPatch outlet;
    //     faces
    //     (
    //         (3 7 6 2)
    //     );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
            // (3 7 6 2)
            // (1 5 4 0)            
        );
    }
    outlet
    {
        type patch;
        faces
        (
          (1 5 4 0)
        );
    //     type cyclic;
    //     neighbourPatch movingWall;
    //     faces
    //     (
    //       (1 5 4 0)
    //     );
    }
    // frontAndBack
    // {
    //     type empty;
    //     faces
    //     (
    //         (0 3 2 1)
    //         (4 5 6 7)
    //      );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //
