tutorials/pureDEM/HFDIBDEMFoam/pouringSpheres/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


bodyNames ("sphere_Top");
interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     0.1;
// stepDEM     1;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 100;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
	LcCoeff 4.0;
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.0;
            mu      0.01;
            adhN    0;
			eps	 	0.05;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            mu      0.01;
            adhN    0;
			eps	 	0.05;
        }
    }

	cyclicPatches
	{

	} 
    collisionPatches
    {
		wall0
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.015 0.00 0.0);
		}
		wall1
		{
			material wall;
			nVec (0.0 1.0 0.0);
			planePoint (0.00 0.05 0.0);
		}
		wall2
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.00 -0.05 0.0);
		}

		wall3
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.015 0.0 0.0);
		}

		wall4
		{
			material wall;
			nVec (0.0 0.0 1.0);
			planePoint ( 0.0 0.0 0.015);
		}

		wall5
		{
			material wall;
			nVec (0.0 0.0 -1.0);
			planePoint (0.0 0.0 -0.015);
		}
    }
}

virtualMesh
{
    level 4;
    charCellSize 0.001;
}

sphere_Top
{

	fullyCoupledBody;
	rho         rho [1 -3 0 0 0 0 0] 4000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel onceScatter;
		onceScatterCoeffs
		{
			addMode fieldBased;
			fieldBasedCoeffs
			{
				fieldName lambda;
				fieldValue 0.1;
			}
			addDomain boundBox;
			boundBoxCoeffs
			{
				minBound (-0.015 -0.04 -0.015);
				maxBound (0.015 0.05 0.015);
			}
			
			scalingMode    noScaling;
			noScalingCoeffs{}
			
			rotationMode   randomRotation;
			randomRotationCoeffs{}
		}
	}
		
	material particle;
	bodyGeom sphere;
	sphere
	{
		radius 0.002;
		startPosition (0 0.035 0);
	}

	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;
	
}
// ************************************************************************* //

